<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Nextcloud Mac client pkg.</string>
    <key>Identifier</key>
    <string>com.github.admantic.download.Nextcloud</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Nextcloud</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(?P&lt;download_url&gt;https://github.com/nextcloud-releases/desktop/releases/download/v(?P&lt;nextcloud_version&gt;[3-9][\.0-9]*)/(?P&lt;pkg_filename&gt;Nextcloud-[a-zA-Z0-9_.-]+\.pkg))</string>
                <key>url</key>
                <string>https://nextcloud.com/install/</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%download_url%</string>
                <key>filename</key>
                <string>%pkg_filename%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Nextcloud GmbH (NKUJUXUJ3B)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
